controllers/WilayahController.php

SELECT `id`, `provinsi` AS `provinsi` FROM `tbl_provinsi`
---
    public function actionAllProvinsi(){
      $out = Provinsi::find()
             ->select(['id','provinsi AS provinsi'])->asArray()->all();